pmo-dataset/graphviz/24.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Hunger noticed" -> "Enter restaurant";
  "Enter restaurant" -> "Choose dish";
  "Choose dish" -> "wait for turn";
  "wait for turn" -> "Place order";
  "Place order" -> "Pay money";
  "Pay money" -> "Take buzzer";
  "Take buzzer" -> "Meal ready_1";
  "Meal ready_1" -> "Get meal";
  "Get meal" -> "Eat meal";
  "Eat meal" -> "Not hungry anymore";
  "Order received" -> "Enter order";
  "Enter order" -> "Collect money";
  "Collect money" -> "Set up buzzer";
  "Set up buzzer" -> "Hand over buzzer";
  "Hand over buzzer" -> "Inform chef";
  "Inform chef" -> "Meal ready_2";
  "Meal ready_2" -> "Set off buzzer";
  "Set off buzzer" -> "EventBasedGateway";
  "EventBasedGateway" -> "Guest appears";
  "Guest appears" -> "Hand over meal";
  "Hand over meal" -> "Order processed";
  "EventBasedGateway" -> "5 minutes";
  "5 minutes" -> "Call guest";
  "Call guest" -> "EventBasedGateway";
  "Meal needed" -> "Prepare meal";
  "Prepare meal" -> "Place meal in hatch";
  "Place meal in hatch" -> "Inform employee";
  "Inform employee" -> "Meal prepared";
  "Place order" -> "Order received" [style=dashed, arrowhead=open];
  "Collect money" -> "Pay money" [style=dashed, arrowhead=open];
  "Pay money" -> "Collect money" [style=dashed, arrowhead=open];
  "Hand over buzzer" -> "Take buzzer" [style=dashed, arrowhead=open];
  "Set off buzzer" -> "Meal ready_1" [style=dashed, arrowhead=open];
  "Get meal" -> "Guest appears" [style=dashed, arrowhead=open];
  "Hand over meal" -> "Get meal" [style=dashed, arrowhead=open];
  "Inform chef" -> "Meal needed" [style=dashed, arrowhead=open];
  "Inform employee" -> "Meal ready_2" [style=dashed, arrowhead=open];
  "Call guest" -> "Pool_1" [style=dashed, arrowhead=open];

  subgraph "cluster_Pool_1" {
    label="Guest food\nconsumption";
    "Enter restaurant";
    "Choose dish";
    "Place order";
    "Pay money";
    "Take buzzer";
    "Get meal";
    "Eat meal";
    "Hunger noticed";
    "Not hungry anymore";
    "wait for turn";
    "Meal ready_1";
    "Pool_1" [shape=point, style=invis];
  }

  subgraph "cluster_Pool_2" {
    label="Employee order\nprocessing";
    "Enter order";
    "Collect money";
    "Set up buzzer";
    "Hand over buzzer";
    "Inform chef";
    "Set off buzzer";
    "Hand over meal";
    "Call guest";
    "Order received";
    "Order processed";
    "Meal ready_2";
    "Guest appears";
    "5 minutes";
    "EventBasedGateway";
  }

  subgraph "cluster_Pool_3" {
    label="Chef meal\npreparation";
    "Prepare meal";
    "Place meal in hatch";
    "Inform employee";
    "Meal needed";
    "Meal prepared";
  }

  "Hunger noticed" [shape=circle];
  "Not hungry anymore" [shape=circle, penwidth=4];
  "wait for turn" [shape=doublecircle];
  "Meal ready_1" [label="Meal ready", shape=doublecircle];
  "Order received" [shape=circle];
  "Order processed" [shape=circle, penwidth=4];
  "Meal ready_2" [label="Meal ready", shape=doublecircle];
  "Guest appears" [shape=doublecircle];
  "5 minutes" [shape=doublecircle];
  "Meal needed" [shape=circle];
  "Meal prepared" [shape=circle, penwidth=4];
  "EventBasedGateway" [label="E", shape=diamond];
}
